app/Validation/Userrules.php

SELECT *
FROM `usuarios`
WHERE `username` = 'edgardocente'
 LIMIT 1
---
    public function validateUser(string $str, string $fields, array $data) {
        $model = new UsuarioModel();

        $user = $model->where('username', $data['username'])->first();