app/Controllers/Admin/AdminController.php

    public function index()
    {
        $usuarioModel = new UsuarioModel();
        $usuarios = $usuarioModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `usuarios`
ORDER BY `id` DESC