app/Controllers/Admin/CarreraController.php

    public function asignarDocentes($carrera)
    {
        $docentes = $this->usuarioModel->where('rol', 'docente')->orderBy('nombre', 'asc')->findAll();
        $carreras = $this->carreraModel->find($carrera);
---
SELECT *
FROM `usuarios`
WHERE `rol` = 'docente'
ORDER BY `nombre` ASC
SELECT *
FROM `carreras`
WHERE `carreras`.`id` = '3'

    public function guardarAsignacion()
    {

        $carreraId = $this->request->getPost('carrera_id');
        $docentesSeleccionados = $this->request->getPost('docentes');

        // Validar datos
        if (empty($docentesSeleccionados)) {
            // Manejar el caso en el que no se hayan seleccionado docentes
            return redirect()->to('carrera/asignar_docentes/' . $carreraId)->with('error', 'Debes seleccionar al menos un docente.');
        }

        // Eliminar asignaciones anteriores para esta carrera
        // $this->docentesCarrerasModel->where('carrera', $carreraId)->delete();

        // Guardar las nuevas asignaciones en la base de datos
        foreach ($docentesSeleccionados as $docenteId) {
            $data = [
                'carrera' => $carreraId,
                'docente' => $docenteId,
            ];

            $this->docentesCarrerasModel->insert($data);
---
INSERT INTO `docentes_carreras` (`carrera`, `docente`, `created_at`, `updated_at`) VALUES ('3', '260', '2023-11-28 05:18:17', '2023-11-28 05:18:17')

                $dia_semana2 = $this->request->getPost('dia_semana2');
                $grupo = $this->request->getPost('grupo');

                $programacionModel->save([
                    'carrera_id' => $carrera_id,
                    'docente_id' => $this->request->getPost('docente'),
                    'materia_id' => $this->request->getPost('asignatura'),
                    'hora_inicio1' => $hora_inicio1,
                    'hora_fin1' => $hora_fin1,
                    'dia_semana1' => $dia_semana1,
                    'hora_inicio2' => $hora_inicio2,
                    'hora_fin2' => $hora_fin2,
                    'dia_semana2' => $dia_semana2,
                    'grupo' => $grupo,
                ]);
---
INSERT INTO `programacion` (`carrera_id`, `docente_id`, `materia_id`, `hora_inicio1`, `hora_fin1`, `dia_semana1`, `hora_inicio2`, `hora_fin2`, `dia_semana2`, `grupo`) VALUES ('3', '260', '56', '08:00', '10:00', 'Lunes', '10:00', '12:00', 'Miércoles', '5B')