app/Controllers/Docente/ProgramacionController.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '260'
---
    public function index()
    {
        $this->session = \Config\Services::session();
        $docente_id = $this->session->id;

        $docenteModel = new UsuarioModel();
        $docente = $docenteModel->find($docente_id);