app/Models/ProgramacionModel.php

    public function getAsignacionesPorDocente($docente_id)
    {
        return $this->select('programacion.*, usuarios.nombre as docente, asignaturas.nombre as asignatura, carreras.nombre as carrera')
            ->join('usuarios', 'usuarios.id = programacion.docente_id', 'left')
            ->join('asignaturas', 'asignaturas.id = programacion.materia_id', 'left')
            ->join('carreras', 'carreras.id = programacion.carrera_id', 'left')
            ->where('docente_id', $docente_id)
            ->findAll();
---
SELECT `programacion`.*, `usuarios`.`nombre` as `docente`, `asignaturas`.`nombre` as `asignatura`, `carreras`.`nombre` as `carrera`
FROM `programacion`
LEFT JOIN `usuarios` ON `usuarios`.`id` = `programacion`.`docente_id`
LEFT JOIN `asignaturas` ON `asignaturas`.`id` = `programacion`.`materia_id`
LEFT JOIN `carreras` ON `carreras`.`id` = `programacion`.`carrera_id`
WHERE `docente_id` = '260'