app/Models/UsuarioModel.php

SELECT *
FROM `docentes_carreras`
WHERE `carrera` = '3'
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '260'
---
    public function getCarreras($carrera_id)
    {
        $docentesCarrerasModel = new DocentesCarrerasModel();
        $carreras = $docentesCarrerasModel->where('carrera', $carrera_id)->findAll();

        $docentes = [];
        foreach ($carreras as $carrera) {
            $docente = $this->find($carrera['docente']);