app/Views/admin/carreras/index.php

SELECT *
FROM `docentes_carreras`
WHERE `carrera` = '1'
---
                    </td>
                    <td>
                        <a class="btn btn-sm btn-secondary mr-1" href="<?= base_url('admin/carreras/asignarDocentes/'.$carrera['id']); ?>">Agregar docentes</a>
                        <!-- Enlace para ver docentes adscritos -->
                        <a class="btn btn-sm btn-secondary mr-1" href="<?= base_url('admin/carreras/vdxc/'.$carrera['id']); ?>">Ver <?= count($this->docentesCarrerasModel->where('carrera', $carrera['id'])->findAll()); ?> docentes</a>